# PartNotIncludedInMerge Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures..::..PartNotIncludedInMerge Property
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class See Also
---
This part is not geometrically coincident with another part of the same material. No merge possible.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartNotIncludedInMerge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartNotIncludedInMerge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartNotIncludedInMerge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace